apache/nuttx/arch/arm/src/imxrt/imxrt_edma_ver3.c
  /* Push tcd into hardware TCD register */

  /* Clear DONE bit first, otherwise ESG cannot be set */

  putreg16(0,             base + IMXRT_EDMA_TCD_CSR_OFFSET);

  putreg32(tcd->saddr,    base + IMXRT_EDMA_TCD_SADDR_OFFSET);
  putreg16(tcd->soff,     base + IMXRT_EDMA_TCD_SOFF_OFFSET);
  putreg16(tcd->attr,     base + IMXRT_EDMA_TCD_ATTR_OFFSET);
  putreg32(tcd->nbytes,   base + IMXRT_EDMA_TCD_NBYTES_OFFSET);
  putreg32(tcd->slast,    base + IMXRT_EDMA_TCD_SLAST_SDA_OFFSET);
  putreg32(tcd->daddr,    base + IMXRT_EDMA_TCD_DADDR_OFFSET);
  putreg16(tcd->doff,     base + IMXRT_EDMA_TCD_DOFF_OFFSET);
  putreg16(tcd->citer,    base + IMXRT_EDMA_TCD_CITER_OFFSET);
  putreg32(tcd->dlastsga, base + IMXRT_EDMA_TCD_DLAST_SGA_OFFSET);

  putreg16(tcd->csr,      base + IMXRT_EDMA_TCD_CSR_OFFSET);

  putreg16(tcd->biter,    base + IMXRT_EDMA_TCD_BITER_OFFSET);
}
#endif

/****************************************************************************
 * Name: imxrt_dmaterminate
 *
 * Description:
 *   Terminate the DMA transfer and disable the DMA channel
 *
 ****************************************************************************/

static void imxrt_dmaterminate(struct imxrt_dmach_s *dmach, int result)
{
  uintptr_t base = IMXRT_EDMA_TCD(dmach->base, dmach->chan);
#if CONFIG_IMXRT_EDMA_NTCD > 0
  struct imxrt_edmatcd_s *tcd;
  struct imxrt_edmatcd_s *next;
#endif
  edma_callback_t callback;
  void *arg;

  irqstate_t flags;

  flags = spin_lock_irqsave(&g_edma.lock);
  sched_lock();

  /* Disable channel IRQ requests */

  putreg32(EDMA_CH_INT, base + IMXRT_EDMA_CH_INT_OFFSET);

  /* Clear CSR to disable channel. Because if the given channel started,
   * transfer CSR will be not zero. Because if it is the last transfer, DREQ
   * will be set.  If not, ESG will be set.
   */

  putreg32(0, base + IMXRT_EDMA_CH_CSR_OFFSET);

  putreg16(0, base + IMXRT_EDMA_TCD_CSR_OFFSET);

  /* Cancel next TCD transfer. */

  putreg32(0, base + IMXRT_EDMA_TCD_DLAST_SGA_OFFSET);

#if CONFIG_IMXRT_EDMA_NTCD > 0
  /* Return all allocated TCDs to the free list */

  for (tcd = dmach->head; tcd != NULL; tcd = next)
    {
      /* If channel looped to itself we are done
       * if not continue to free tcds in chain
       */

       next = dmach->flags & EDMA_CONFIG_LOOPDEST ?
              NULL : (struct imxrt_edmatcd_s *)((uintptr_t)tcd->dlastsga);

       imxrt_tcd_free_nolock(tcd);
    }

  dmach->head = NULL;
  dmach->tail = NULL;
#endif

  /* Perform the DMA complete callback */

  callback = dmach->callback;
  arg      = dmach->arg;

  dmach->callback = NULL;
  dmach->arg      = NULL;
  dmach->state    = IMXRT_DMA_IDLE;

  spin_unlock_irqrestore(&g_edma.lock, flags);
  sched_unlock();

  if (callback)
    {
      callback((DMACH_HANDLE)dmach, arg, true, result);
    }
}

/****************************************************************************
 * Name: imxrt_edma_intstatus
 *
 * Description:
 *   DMA interrupt status per eDMA engine and channel.
 *
 ****************************************************************************/

static inline uint32_t imxrt_edma_intstatus(uintptr_t base, uint8_t chan)
{
  /* The status register varies depending on eDMA instance and channel */

#ifdef IMXRT_DMA3_BASE
  /* eDMA3 uses the normal INT register */

  if (base == IMXRT_DMA3_BASE)
    {
      return getreg32(IMXRT_EDMA_INT);
    }
#endif

#ifdef IMXRT_DMA4_BASE
  /* eDMA4 has two INT status registers, holding 32 statuses each */

  if (chan > 31)
    {
      return getreg32(IMXRT_EDMA_INT_HIGH);
    }

  return getreg32(IMXRT_EDMA_INT_LOW);
#endif
}

/****************************************************************************
 * Name: imxrt_edma_isr
 *
 * Description:
 *   DMA interrupt service routine. The vector handler calls this with the
 *   appropriate parameters.
 *
 ****************************************************************************/

static int imxrt_edma_isr(int irq, void *context, void *arg)
{
  struct imxrt_dmach_s *dmach;
  uintptr_t base;
  uint32_t  regval32;
  uint32_t  errval32;
  uint8_t   chan;
  int       result;

  /* 'arg' should the DMA channel instance. */

  dmach = (struct imxrt_dmach_s *)arg;
  DEBUGASSERT(dmach != NULL);

  chan  = dmach->chan;
  base  = IMXRT_EDMA_TCD(dmach->base, dmach->chan);

  /* Get the eDMA Error Status register value. */

  errval32  = getreg32(base + IMXRT_EDMA_CH_ES_OFFSET);

  if (errval32 & EDMA_CH_ES_ERR)
    {
      DEBUGASSERT(dmach->state == IMXRT_DMA_ACTIVE);

      /* Clear the error */

      putreg32(EDMA_CH_ES_ERR, base + IMXRT_EDMA_CH_ES_OFFSET);

      /* Clear the pending eDMA channel interrupt */

      putreg32(EDMA_CH_INT, base + IMXRT_EDMA_CH_INT_OFFSET);

      imxrt_dmaterminate(dmach, -EIO);
      return OK;
    }

  /* Check for an eDMA pending interrupt on this channel */

  regval32 = imxrt_edma_intstatus(dmach->base, dmach->chan);
  if ((regval32 & EDMA_INT(chan & 31)) != 0)
    {
      /* An interrupt is pending.
       * This should only happen if the channel is active.
       */

      DEBUGASSERT(dmach->state == IMXRT_DMA_ACTIVE);

      /* Clear the pending eDMA channel interrupt */

      putreg32(EDMA_CH_INT, base + IMXRT_EDMA_CH_INT_OFFSET);

      /* Get the eDMA TCD Control and Status register value. */

      regval32 = getreg32(base + IMXRT_EDMA_CH_CSR_OFFSET);

      /* Check if transfer has finished. */

      if ((regval32 & EDMA_CH_CSR_DONE) != 0)
        {
          /* Clear the pending DONE interrupt status. */

          regval32 |= EDMA_CH_CSR_DONE;
          putreg32(regval32, base + IMXRT_EDMA_CH_CSR_OFFSET);
          result = OK;
        }
      else
        {
          /* Perform the half or end-of-major-cycle DMA callback */

          if (dmach->callback != NULL)
            {
              dmach->callback((DMACH_HANDLE)dmach, dmach->arg, false, OK);
            }

          return OK;
        }

      /* Terminate the transfer when it is done. */

      if ((dmach->flags & EDMA_CONFIG_LOOP_MASK) == 0)
        {
          imxrt_dmaterminate(dmach, result);
        }
      else if (dmach->callback != NULL)
        {
          dmach->callback((DMACH_HANDLE)dmach, dmach->arg, true, result);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: imxrt_edma_interrupt
 *
 * Description:
 *   DMA interrupt handler.  This function clears the channel major
 *   interrupt flag and calls the callback function if it is not NULL.
 *
 *   NOTE:  For the case using TCD queue, when the major iteration count is
 *   exhausted, additional operations are performed.  These include the
 *   final address adjustments and reloading of the BITER field into the
 *   CITER.  Assertion of an optional interrupt request also occurs at this
 *   time, as does a possible fetch of a new TCD from memory using the
 *   scatter/gather address pointer included in the descriptor (if scatter/
 *   gather is enabled).
 *
 ****************************************************************************/

